#!/usr/bin/python
# -*- coding: UTF-8 -*-
# Thanks to https://kaiyuzheng.me/dump/codings/IChingViewer/

import numpy as np
import pickle

"""
朱熹《卦序歌》

乾坤屯蒙需讼师，比小畜兮履泰否。

同人大有谦豫随，蛊临观兮噬嗑贲。

剥复无妄大畜颐，大过坎离三十备。

咸恒遁兮及大壮，晋与明夷家人睽。

蹇解损益夬姤萃，升困井革鼎震继。

艮渐归妹丰旅巽，兑涣节兮中孚至。

小过既济兼未济，是为下经三十四。
"""


key_1 = [1,1,1,1,1,1]
value_1 = ["乾", "元亨利贞" ]
yaoci_1 = ["初九，潜龙勿用", "九二，现龙在田，利见大人",
"九三，君子终日乾乾，夕惕若厉，无咎。", "九四，或跃在渊，无咎。",
"九五，飞龙在天，利见大人", "上九，亢龙无悔",
"用九，见群龙，无首，吉。"]

key_2 = [0,0,0,0,0,0]
value_2 = ["坤", "元亨，利牝马之贞。君子有攸往，先迷后得主，利。西南得朋，东北丧朋，安贞吉。" ]
yaoci_2 = ["初六，履霜，坚冰至。", "六二、直方大，不习无不利。",
"六三，含章可贞，或从王事，无成有终。", "六四，括囊，无咎无誉。",
"六五，黄裳，元吉。", "上六，龙战于野，其血玄黄。",
"用六，利永贞。"]

key_3 = [1,0,0, 0,1,0]
value_3 = ["屯", "元亨利贞。勿用有攸往，利建侯。" ]
yaoci_3 = ["初九，磐桓，利居贞，利建侯。",
           "六二，屯如，邅如。乘马班如，匪寇婚媾。女子贞不字，十年乃字。",
           "六三，即鹿无虞，惟入于林中。君子几，不如舍，往吝。",
           "六四，乘马班如，求婚媾；往吉，无不利。",
           "九五，屯其膏，小贞吉，大贞凶。",
           "上六，乘马班如，泣血涟如。"]

key_4 = [0,1,0, 0,0,1]
value_4 = ["蒙", "亨。匪我求童蒙，童蒙求我。初筮告，再三渎，渎则不告。利贞。" ]
yaoci_4 = ["初六，发蒙，利用刑人，用说桎梏；以往吝。",
           "九二，包蒙吉，纳妇吉，子克家。",
           "六三，勿用取女。见金夫，不有躬，无攸利。",
           "六四，困蒙，吝。",
           "六五，童蒙，吉。",
           "上九，击蒙，不利为寇，利御寇。"]

key_5 = [1,1,1,0,1,0]
value_5 = ["需", "有孚，光亨，贞吉，利涉大川。" ]
yaoci_5 = ["初九，需于郊，利用恒，无咎。",
           "九二，需于沙，小有言，终吉。",
           "九三，需于泥，致寇至。",
           "六四，需于血，出自穴。",
           "九五，需于酒食，贞吉。",
           "上六，入于穴，有不速之客三人来，敬之，终吉。"]

key_6 = [0,1,0, 1,1,1]
value_6 = ["讼", "有孚窒惕，中吉，终凶。利见大人，不利涉大川。" ]
yaoci_6 = ["初六，不永所事，小有言，终吉",
           "九二，不克讼，归而逋其邑。人三百户，无眚。",
           "六三，食旧德，贞厉，终吉；或从王事，无成。",
           "九四，不克讼，复即命渝，安贞吉。",
           "九五，讼，元吉。",
           "上九，或锡之鞶带，终朝三褫之。"]

key_7 = [0,1,0, 0,0,0]
value_7 = ["师", "贞，丈人吉，无咎。" ]
yaoci_7 = ["初六，师出以律，否臧凶。",
           "九二，在师中，吉，无咎，王三锡命。",
           "六三，师或舆尸，凶。",
           "六四，师左次，无咎。",
           "六五，田有禽，利执言，无咎。长子帅师，弟子舆尸，贞凶。",
           "上六，大君有命，开国承家，小人勿用。"]

key_8 = [0,0,0, 0,1,0]
value_8 = ["比", "吉，原筮，元永贞，无咎。不宁方来，后夫凶。" ]
yaoci_8 = ["初六，有孚比之，无咎。有孚盈缶，终来有他吉。",
           "六二，比之自内，贞吉。",
           "六三，比之匪人。",
           "六四，外比之，贞吉。",
           "九五，显比。王用三驱，失前禽；邑人不诫，吉。",
           "上六，比之无首，凶。"]



key_9 = [1,1,1,0,1,1]
value_9 = ["小畜", "亨。密云不雨，自我西郊。" ]
yaoci_9 = ["初九，复自道，何其咎？吉。",
           "九二，牵复，吉。",
           "九三，舆说辐，夫妻反目。",
           "六四，有孚，血去惕出，无咎。",
           "九五，有孚挛如，富以其邻。",
           "上九，既雨既处，尚得载；妇贞厉，月几望；君子征凶。"]

key_10 = [1,1,0, 1,1,1]
value_10 = ["履", "虎尾，不咥人，亨。" ]
yaoci_10 = ["初九，素履往，无咎。",
           "九二，履道坦坦，幽人贞吉。",
           "六三，眇能视，跛能履；履虎尾，咥人，凶。武人为于大君。",
           "九四，履虎尾，愬愬，终吉。",
           "九五，夬履，贞厉。",
           "上九，视履考祥，其旋元吉。"]

key_11 = [1,1,1,0,0,0]
value_11 = ["泰", "小往大来，吉，亨。" ]
yaoci_11 = ["初九，拔茅茹，以其汇，征吉。",
           "九二，包荒，用冯河；不遐遗，朋亡，得尚于中行。",
           "九三，无平不陂，无往不复；艰贞，无咎；勿恤其孚，于食有福。",
           "六四，翩翩，不富于其邻。不戒以孚。",
           "六五，帝乙归妹，以祉元吉。不戒以孚，中心愿也。",
           "上六，城复于隍，勿用师。自邑告命，贞吉。"]


key_12 = [0,0,0, 1,1,1]
value_12 = ["否", "否之匪人，不利君子贞，大往小来。" ]
yaoci_12 = ["初六，拔茅茹，以其汇，贞吉，亨。",
           "六二、包承，小人吉，大人否，亨。",
           "六三，包羞。",
           "九四，有命，无咎，畴离祉。",
           "九五，休否，大人吉；其亡其亡，系于苞桑。",
           "上九，倾否，先否后喜。"]

key_13 = [1,0,1, 1,1,1]
value_13 = ["同人", "于野，亨。利涉大川，利君子贞。" ]
yaoci_13 = ["初九，同人于门，无咎。",
           "六二，同人于宗，吝。",
           "九三，伏戎于莽，升其高陵，三岁不兴。",
           "九四，乘其墉，弗克攻，吉。",
           "九五，同人，先号咷而后笑，大师克相遇。",
           "上九，同人于郊，无悔。"]


key_14 = [1,1,1,1,0,1]
value_14 = ["大有", "元亨。" ]
yaoci_14 = ["初九，无交害，匪咎，艰则无咎。",
           "九二，大车以载，有攸往，无咎。",
           "九三，公用亨于天子，小人弗克。",
           "九四，匪其彭，无咎。",
           "六五，厥孚交如，威如，吉。",
           "上九，自天祐之，吉无不利。"]

key_15 = [0,0,1, 0,0,0]
value_15 = ["谦", "亨，君子有终。" ]
yaoci_15 = ["初六，谦谦君子，用涉大川，吉。",
           "六二，鸣谦，贞吉。",
           "九三，劳谦，君子有终，吉。",
           "六四，无不利，撝谦。",
           "六五，不富以其邻，利用侵伐，无不利。",
           "上六，鸣谦，利用行师，征邑国。"]

key_ = [0,0,0, 1,0,0]
value_ = ["豫", "利建侯行师。" ]
yaoci_ = ["初六，鸣豫，凶。",
           "六二，介于石，不终日，贞吉。",
           "六三，盱豫，悔，迟，有悔",
           "九四，由豫，大有得，勿疑，朋盍簪。",
           "六五，贞疾，恒不死。",
           "上六，冥豫成，有渝无咎。"]



key_ = [1,1,1,1,0,0]
value_ = ["", "" ]
yaoci_ = ["",
           "",
           "",
           "",
           "",
           ""]

key_26 = [1,1,1,0,0,1]
value_26 = ["大畜", "利贞。不家食，吉，利涉大川。" ]
yaoci_26 = ["初九，有厉，利己。",
           "九二，舆说輹。",
           "九三，良马逐，利艰贞。日闲舆卫，利有攸往。",
           "六四，童牛之牯，元吉。",
           "六五，豮豕之牙，吉。",
           "上九，何天之衢，亨。"]

key_34 = [1,1,1,1,0,0]
value_34 = ["大壮", "利贞。" ]
yaoci_34 = ["初九，壮于趾，征凶，有孚。",
           "九二，贞吉。",
           "九三，小人用壮，君子用罔，贞厉。羝羊触藩，羸其角。",
           "九四，贞吉，悔亡。藩决不羸，壮于大舆之輹。",
           "六五，丧羊于易，无悔。",
           "上六，羝羊触藩，不能退，不能遂。无攸利，艰贞吉。"]


key_43 = [1,1,1,1,1,0]
value_43 = ["夬", "扬于王庭，孚号有厉。告自邑，不利即戎。利有攸往。" ]
yaoci_43 = ["初九，壮于前趾，往不胜，为咎。",
           "九二，惕号，莫夜有戎，勿恤。",
           "九三，壮于頄，有凶。君子夬夬，独行，遇雨若濡。有愠，无咎。",
           "九四，臀无肤，其行次且。牵羊悔亡，闻言不信。",
           "九五，苋陆夬夬，中行无咎。",
           "上六，无号，终有凶。"]



key_ = [1,1,1,1,0,0]
value_ = ["", "" ]
yaoci_ = ["",
           "",
           "",
           "",
           "",
           ""]
# print(key_1, value_1)
value_1.append(yaoci_1)

print(value_1)